OF4.0/tutorials/unidirectionalSheetFlow/mixtureKE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       399;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       799;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       1199;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       1200;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       1201;
    }
)

// ************************************************************************* //
