OF4.0/tutorials/unidirectionalSheetFlow/mixtureKE/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (sand water air);

sand
{
    transportModel  BoyerEtAl;	//Type of mixture viscosity closure
    
	dargModel	driftFlux;			//Type of drag closure
	m				3.15;			// m = 3.0 - 2n, n is constant in driftFlux drag model		
	
	d				1.50e-3;		//Sand diameter = d * shape factor
	alphaMax		0.58;		//Random close packing volume fraction
	packingLimiter	false;		//Flag to apply packing limiter in aphad_Eqn
	ULimiter		false;		//Flag to apply limiter on the particle velocity
    rho         	1190;		//Sand density
	Sct				0.4;		//Turbulent Schmidt number

	mupMax			mupMax [1 -1 -1 0 0 0 0] 1.0e02;
}

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-06;
    rho             [1 -3 0 0 0 0 0] 1000;
}

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-05;
    rho             [1 -3 0 0 0 0 0] 1;
}

sigma           [1 0 -2 0 0 0 0] 0.07;

//Mean pressure gradient
gradPMean        gradPMean        [ 1 -2 -2 0 0 0 0 ] (18.639 0 0 ); // mean pressure

//Relative velocity parameters
relativeVelocity
	{
		turbulentDispersion		true;	//Flag to include turbulent dispersion force 
		shearInduced			true;	//Flag to include shear induced self-diffusion
		nWCdCorrectors			4;		//No. of W-CD coupling loop iterations

	}


//Granular rheology paramaters
granularRheology
	{
		//Johnson and Jackson (1987) fricitional pressure parameters
		alphaMinFriction	alphaMinFriction [ 0 0 0 0 0 0 0 ] 0.53;	//Minimum volume fraction to activate frictional pressure
		Cp					Cp [ 1 -1 -2 0 0 0 0 ] 5e-2;
		C1					C1 [ 0 0 0 0 0 0 0 ] 3;
		C2					C2 [ 0 0 0 0 0 0 0 ] 5;	

		//Kinetic or collisional pressure parameters
		kineticPressure		true;								//Flag to solve for kinetic pressure
		Bphi            	Bphi [ 0 0 0 0 0 0 0 ] 0.66;		//Parameter of the dilatancy law (0.25 to 0.9)
		relaxPsk			relaxPsk [0 0 0 0 0 0 0] 0.005;		//Relaxation factor for psk 
		
		//Particle shear viscosity parameters
		lambdaR				lambdaR [ 0 0 -1 0 0 0 0 ] 1.0e-6;	//Regularization parameter
		mus					mus  [ 0 0 0 0 0 0 0 ] 0.52;			//static friction coefficient (tangent of the angle of repose)
		mu2         	    mu2  [ 0 0 0 0 0 0 0 ] 0.96;			//dynamical friction coefficient 
		I0					I0   [ 0 0 0 0 0 0 0 ] 0.6;			//empirical rheological coefficient 		 
	}

removeAir	false;
addWater	false;



// ************************************************************************* //
