OF4.0/tutorials/unidirectionalSheetFlow/mixtureKE/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel mixtureKEpsilon;

    turbulence      on;
    printCoeffs     on;

    mixtureKEpsilonCoeffs
    {
        Cg      1.0;  // 1.0/Sct
		B       0.25;
		C3eps   1.2;
		sigmak	0.6;
		C3k		0.9;	
    }

}






// ************************************************************************* //
